Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CD1G.svd
            <register>
               <name>BASENEXT</name>
               <description>Base DMA Next Register</description>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NEXT</name>
                     <description>DMA Descriptor Next Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG0</name>
               <description>Base Layer Configuration Register 0</description>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIF</name>
                     <description>Source Interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEN</name>
                     <description>AHB Burst Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BLENSelect</name>
                        <enumeratedValue>
                           <name>AHB_SINGLE</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR4</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR8</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AHB_INCR16</name>
                           <description>AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLBO</name>
                     <description>Defined Length Burst Only For Channel Bus Transaction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG1</name>
               <description>Base Layer Configuration Register 1</description>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLUTEN</name>
                     <description>Color Lookup Table Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGBMODE</name>
                     <description>RGB Mode Input Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>RGBMODESelect</name>
                        <enumeratedValue>
                           <name>_12BPP_RGB_444</name>
                           <description>12 bpp RGB 444</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_ARGB_4444</name>
                           <description>16 bpp ARGB 4444</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGBA_4444</name>
                           <description>16 bpp RGBA 4444</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_RGB_565</name>
                           <description>16 bpp RGB 565</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16BPP_TRGB_1555</name>
                           <description>16 bpp TRGB 1555</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666</name>
                           <description>18 bpp RGB 666</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_18BPP_RGB_666PACKED</name>
                           <description>18 bpp RGB 666 PACKED</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_1666</name>
                           <description>19 bpp TRGB 1666</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_19BPP_TRGB_PACKED</name>
                           <description>19 bpp TRGB 1666 PACKED</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888</name>
                           <description>24 bpp RGB 888</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24BPP_RGB_888_PACKED</name>
                           <description>24 bpp RGB 888 PACKED</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_25BPP_TRGB_1888</name>
                           <description>25 bpp TRGB 1888</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_ARGB_8888</name>
                           <description>32 bpp ARGB 8888</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32BPP_RGBA_8888</name>
                           <description>32 bpp RGBA 8888</description>
                           <value>0xD</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLUTMODE</name>
                     <description>Color Lookup Table Mode Input Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CLUTMODESelect</name>
                        <enumeratedValue>
                           <name>CLUT_1BPP</name>
                           <description>Color Lookup Table mode set to 1 bit per pixel</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_2BPP</name>
                           <description>Color Lookup Table mode set to 2 bits per pixel</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_4BPP</name>
                           <description>Color Lookup Table mode set to 4 bits per pixel</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLUT_8BPP</name>
                           <description>Color Lookup Table mode set to 8 bits per pixel</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG2</name>
               <description>Base Layer Configuration Register 2</description>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XSTRIDE</name>
                     <description>Horizontal Stride</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG3</name>
               <description>Base Layer Configuration Register 3</description>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BDEF</name>
                     <description>Blue Default</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GDEF</name>
                     <description>Green Default</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RDEF</name>
                     <description>Red Default</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG4</name>
               <description>Base Layer Configuration Register 4</description>
               <addressOffset>0x0000007C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>Use DMA Data Path</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REP</name>
                     <description>Use Replication logic to expand RGB color to 24 bits</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCEN</name>
                     <description>Discard Area Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG5</name>
               <description>Base Layer Configuration Register 5</description>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISCXPOS</name>
                     <description>Discard Area Horizontal Coordinate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DISCYPOS</name>
                     <description>Discard Area Vertical Coordinate</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASECFG6</name>
               <description>Base Layer Configuration Register 6</description>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DISCXSIZE</name>
                     <description>Discard Area Horizontal Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DISCYSIZE</name>
                     <description>Discard Area Vertical Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1CHER</name>
               <description>Overlay 1 Channel Enable Register</description>
               <addressOffset>0x00000140</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHEN</name>
                     <description>Channel Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATEEN</name>
                     <description>Update Overlay Attributes Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QEN</name>
                     <description>Add To Queue Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1CHDR</name>
               <description>Overlay 1 Channel Disable Register</description>
               <addressOffset>0x00000144</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHRST</name>
                     <description>Channel Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1CHSR</name>
               <description>Overlay 1 Channel Status Register</description>
               <addressOffset>0x00000148</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHSR</name>
                     <description>Channel Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UPDATESR</name>
                     <description>Update Overlay Attributes In Progress Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>A2QSR</name>
                     <description>Add To Queue Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1IER</name>
               <description>Overlay 1 Interrupt Enable Register</description>
               <addressOffset>0x0000014C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1IDR</name>
               <description>Overlay 1 Interrupt Disable Register</description>
               <addressOffset>0x00000150</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1IMR</name>
               <description>Overlay 1 Interrupt Mask Register</description>
               <addressOffset>0x00000154</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OVR1ISR</name>
               <description>Overlay 1 Interrupt Status Register</description>
               <addressOffset>0x00000158</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>End of DMA Transfer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSCR</name>
                     <description>DMA Descriptor Loaded</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Head Descriptor Loaded</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DONE</name>
                     <description>End of List Detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overflow Detected</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
