Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CD1G.svd
            <register>
               <name>GRWS</name>
               <description>Global Channel Read Write Suspend Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RWS0</name>
                     <description>XDMAC Channel 0 Read Write Suspend Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS1</name>
                     <description>XDMAC Channel 1 Read Write Suspend Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS2</name>
                     <description>XDMAC Channel 2 Read Write Suspend Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS3</name>
                     <description>XDMAC Channel 3 Read Write Suspend Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS4</name>
                     <description>XDMAC Channel 4 Read Write Suspend Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS5</name>
                     <description>XDMAC Channel 5 Read Write Suspend Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS6</name>
                     <description>XDMAC Channel 6 Read Write Suspend Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS7</name>
                     <description>XDMAC Channel 7 Read Write Suspend Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS8</name>
                     <description>XDMAC Channel 8 Read Write Suspend Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS9</name>
                     <description>XDMAC Channel 9 Read Write Suspend Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS10</name>
                     <description>XDMAC Channel 10 Read Write Suspend Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS11</name>
                     <description>XDMAC Channel 11 Read Write Suspend Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS12</name>
                     <description>XDMAC Channel 12 Read Write Suspend Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS13</name>
                     <description>XDMAC Channel 13 Read Write Suspend Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS14</name>
                     <description>XDMAC Channel 14 Read Write Suspend Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS15</name>
                     <description>XDMAC Channel 15 Read Write Suspend Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GRWR</name>
               <description>Global Channel Read Write Resume Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RWR0</name>
                     <description>XDMAC Channel 0 Read Write Resume Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR1</name>
                     <description>XDMAC Channel 1 Read Write Resume Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR2</name>
                     <description>XDMAC Channel 2 Read Write Resume Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR3</name>
                     <description>XDMAC Channel 3 Read Write Resume Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR4</name>
                     <description>XDMAC Channel 4 Read Write Resume Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR5</name>
                     <description>XDMAC Channel 5 Read Write Resume Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR6</name>
                     <description>XDMAC Channel 6 Read Write Resume Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR7</name>
                     <description>XDMAC Channel 7 Read Write Resume Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR8</name>
                     <description>XDMAC Channel 8 Read Write Resume Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR9</name>
                     <description>XDMAC Channel 9 Read Write Resume Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR10</name>
                     <description>XDMAC Channel 10 Read Write Resume Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR11</name>
                     <description>XDMAC Channel 11 Read Write Resume Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR12</name>
                     <description>XDMAC Channel 12 Read Write Resume Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR13</name>
                     <description>XDMAC Channel 13 Read Write Resume Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR14</name>
                     <description>XDMAC Channel 14 Read Write Resume Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR15</name>
                     <description>XDMAC Channel 15 Read Write Resume Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GSWR</name>
               <description>Global Channel Software Request Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWREQ0</name>
                     <description>XDMAC Channel 0 Software Request Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ1</name>
                     <description>XDMAC Channel 1 Software Request Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ2</name>
                     <description>XDMAC Channel 2 Software Request Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ3</name>
                     <description>XDMAC Channel 3 Software Request Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ4</name>
                     <description>XDMAC Channel 4 Software Request Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ5</name>
                     <description>XDMAC Channel 5 Software Request Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ6</name>
                     <description>XDMAC Channel 6 Software Request Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ7</name>
                     <description>XDMAC Channel 7 Software Request Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ8</name>
                     <description>XDMAC Channel 8 Software Request Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ9</name>
                     <description>XDMAC Channel 9 Software Request Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ10</name>
                     <description>XDMAC Channel 10 Software Request Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ11</name>
                     <description>XDMAC Channel 11 Software Request Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ12</name>
                     <description>XDMAC Channel 12 Software Request Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ13</name>
                     <description>XDMAC Channel 13 Software Request Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ14</name>
                     <description>XDMAC Channel 14 Software Request Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ15</name>
                     <description>XDMAC Channel 15 Software Request Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GSWS</name>
               <description>Global Channel Software Request Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SWRS0</name>
                     <description>XDMAC Channel 0 Software Request Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS1</name>
                     <description>XDMAC Channel 1 Software Request Status Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS2</name>
                     <description>XDMAC Channel 2 Software Request Status Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS3</name>
                     <description>XDMAC Channel 3 Software Request Status Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS4</name>
                     <description>XDMAC Channel 4 Software Request Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS5</name>
                     <description>XDMAC Channel 5 Software Request Status Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS6</name>
                     <description>XDMAC Channel 6 Software Request Status Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS7</name>
                     <description>XDMAC Channel 7 Software Request Status Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS8</name>
                     <description>XDMAC Channel 8 Software Request Status Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS9</name>
                     <description>XDMAC Channel 9 Software Request Status Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS10</name>
                     <description>XDMAC Channel 10 Software Request Status Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS11</name>
                     <description>XDMAC Channel 11 Software Request Status Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS12</name>
                     <description>XDMAC Channel 12 Software Request Status Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS13</name>
                     <description>XDMAC Channel 13 Software Request Status Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS14</name>
                     <description>XDMAC Channel 14 Software Request Status Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS15</name>
                     <description>XDMAC Channel 15 Software Request Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GSWF</name>
               <description>Global Channel Software Flush Request Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWF0</name>
                     <description>XDMAC Channel 0 Software Flush Request Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF1</name>
                     <description>XDMAC Channel 1 Software Flush Request Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF2</name>
                     <description>XDMAC Channel 2 Software Flush Request Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF3</name>
                     <description>XDMAC Channel 3 Software Flush Request Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF4</name>
                     <description>XDMAC Channel 4 Software Flush Request Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF5</name>
                     <description>XDMAC Channel 5 Software Flush Request Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF6</name>
                     <description>XDMAC Channel 6 Software Flush Request Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF7</name>
                     <description>XDMAC Channel 7 Software Flush Request Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF8</name>
                     <description>XDMAC Channel 8 Software Flush Request Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF9</name>
                     <description>XDMAC Channel 9 Software Flush Request Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF10</name>
                     <description>XDMAC Channel 10 Software Flush Request Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF11</name>
                     <description>XDMAC Channel 11 Software Flush Request Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF12</name>
                     <description>XDMAC Channel 12 Software Flush Request Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF13</name>
                     <description>XDMAC Channel 13 Software Flush Request Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF14</name>
                     <description>XDMAC Channel 14 Software Flush Request Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF15</name>
                     <description>XDMAC Channel 15 Software Flush Request Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
